# Read nested Json object using Pandas

In [1]:
data = {"data": [
        {
            "state": "Florida",
            "shortname": "FL",
            "info": {"capital": "Tallahassee", "area":65758},
            "counties": [
                {"name": "Dade", "population": 12345},
                {"name": "Broward", "population": 40000},
                {"name": "Palm Beach", "population": 60000},
            ],
        },
        {
            "state": "Ohio",
            "shortname": "OH",
            "info": {"capital": "Columbus", "area":44825},
            "counties": [
                {"name": "Summit", "population": 1234},
                {"name": "Cuyahoga", "population": 1337},
            ],
        },
    ]
}

In [2]:
import pandas as pd

In [3]:
result = pd.json_normalize(
    data["data"], "counties", ["state", "shortname",
                              ["info", "capital"],
                              ["info", "area"]]
)
result

         name  population    state shortname info.capital info.area
0        Dade       12345  Florida        FL  Tallahassee     65758
1     Broward       40000  Florida        FL  Tallahassee     65758
2  Palm Beach       60000  Florida        FL  Tallahassee     65758
3      Summit        1234     Ohio        OH     Columbus     44825
4    Cuyahoga        1337     Ohio        OH     Columbus     44825